---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceNormal
source: html/86af03a8-6dc5-c6c5-2ee3-1478f7919574.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceNormal Property

The property labeled "Image" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string SurfaceNormal { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.